import React from "react";
import Image from "next/image";

const Aboutnagarpalika = () => {
  return (
    <div className="flex flex-col md:flex-row items-center justify-between p-2 md:p-5 space-y-5 md:space-y-0  ">
      {/* Left Section - Details */}
      <div className="md:col-span-8 w-full p-7">
        <h2 className="text-2xl text-primary font-bold mb-4">
          About Nagar Palika
        </h2>
        <p className="text-gray-800">
          {/* Waste management is a crucial service in Noorpur Nagar Palika, which
          consists of 29 wards. A dedicated waste management application has
          been introduced to streamline garbage collection across all wards.
          This app allows residents to monitor garbage collection schedules and
          report any missed pickups.The initiative aims to reduce environmental
          pollution, encourage recycling, and improve the overall quality of
          life in the community. */}
                नगरपालिका परिषद नूरपुर जनपद-बिजनौर की एक महत्वपूर्ण शहरी निकाय है जो
          मुरादाबाद-बिजनौर रोड पर स्थित है। कस्बा नूरपुर से कई महत्वपूर्ण सड़क
          मार्ग गुजरते हैं जैसे — हरिद्वार-नूरपुर-अमरोहा,
          बिजनौर-नूरपुर-मुरादाबाद, नूरपुर-स्वाहारा-काशीपुर,
          नूरपुर-चांदपुर-गजरौला आदि, जिसके कारण से कस्बा सड़क मार्गों के बेहतर
          सम्पर्क से जुड़ा है। इसका क्षेत्रफल लगभग 1.55 वर्ग कि॰मी॰ है। वर्ष
          2011 की जनगणना के अनुसार कस्बे की कुल जनसंख्या — 38,801 है जिसमें
          20,120 पुरुष 18,190 महिलाएं व 01 अन्य सामिलित हैं। क्षेत्र की
          महत्वपूर्ण भौगोलिक स्थिति व बढ़ते हुए औद्योगिक केन्द्र को दृष्टिगत
          रखते हुए सरकार के द्वारा 29 सितम्बर 1977 को नगर पंचायत के रूप में
          मान्यता दी गई जिसे बाद में 01 अगस्त 1983 को नगरपालिका परिषद के रूप में
          उच्चीकृत किया गया। वर्तमान में निकाय तृतीय श्रेणी की नगरपालिका है
          जिसमें कुल 25 वार्ड हैं।
          <br/>
          कस्बे में अनब्लॉक जेकट निर्माण का कार्य बड़े पैमाने पर किया जाता है।
          कस्बे में स्थित शहीद स्मारक स्थल (मौ० शहीदनगर वार्ड सं०-21) भारत छोड़ो
          आन्दोलन से सम्बंधित एक प्रमुख ऐतिहासिक स्थल है जहां भारत छोड़ो आन्दोलन
          के दौरान थाना नूरपुर पर क्रांतिकारियों द्वारा ध्वजारोहण के दौरान पुलिस
          मुठभेड़ हुई जिसमें 02 क्रांतिकारी— शहीद परवीन सिंह व शहीद रिखी सिंह
          शहीद हो गये। क्रांतिकारियों की याद में यहां प्रतिवर्ष 16 अगस्त को
          उत्सव मनाया जाता है तथा इन क्रांतिकारी वीरों की शहादत को श्रद्धांजलि
          दी जाती है।
          <br />
          <br />
          कस्बा नूरपुर अपनी समृद्ध सांस्कृतिक विरासत व धार्मिक सद्भाव के रूप में
          जाना जाता है। यहां हिन्दू मुस्लिम, सिक्ख, ईसाई सभी सम्प्रदायों व
          धर्मों के लोग मिल-जुल कर सद्भावपूर्वक रहते हैं। मोहर्रम का जुलूस,
          रामडोल शौभायात्रा, नगर कीर्तन, श्री रामजी की बारात व श्री रविदास व डा०
          भीमराव अम्बेडकर जी की जयन्ती पर निकाली जाने वाली शौभा यात्राओं में इसे
          आसानी से देखा जा सकता है।
          <br />
          

    
        </p>
        <br></br>
        <p className="text-gray-800">
        नूरपुर नगर पालिका में कचरा प्रबंधन एक महत्वपूर्ण सेवा है, जिसमें 29
          वार्ड्स शामिल हैं। कचरा संग्रहण को सरल बनाने के लिए एक समर्पित कचरा
          प्रबंधन एप्लिकेशन पेश किया गया है। इस एप्लिकेशन के माध्यम से निवासी
          कचरा संग्रहण के कार्यक्रम की निगरानी कर सकते हैं और यदि कोई कचरा उठाने
          का कार्य छूट जाए तो उसकी रिपोर्ट भी कर सकते हैं। इस पहल का उद्देश्य
          पर्यावरणीय प्रदूषण को कम करना, पुनःचक्रण को बढ़ावा देना और समुदाय में
          जीवन स्तर को सुधारना है। कचरा प्रबंधन एप्लिकेशन नोर्पुर नगर पालिका
          अधिकारियों को सभी 29 वार्ड्स में कचरा संग्रहण की निगरानी और प्रबंधन
          करने में सक्षम बनाता है। इस सिस्टम के जरिए वे कचरा एकत्र करने वालों के
          प्रदर्शन को ट्रैक कर सकते हैं, संसाधनों का सही तरीके से आवंटन कर सकते
          हैं। यह एप्लिकेशन पारदर्शिता को बढ़ावा देता है क्योंकि यह निवासियों को
          फीडबैक देने का अवसर प्रदान करता है, ताकि उनकी आवाज़ सुनी जा सके। कचरा
          प्रबंधन में डिजिटल तकनीकी का समावेश कर, नूरपुर नगर पालिका का लक्ष्य
          शहर को स्वच्छ और हरित बनाना है। यह एप्लिकेशन स्थिरता के प्रयासों को भी
          समर्थन करता है, जिससे निवासी पुनःचक्रण योग्य सामग्री को गैर-पुनःचक्रण
          योग्य कचरे से अलग करने में मदद कर सकें, और इस प्रकार एक अधिक पर्यावरण
          के अनुकूल वातावरण की दिशा में योगदान कर सकें।
         
          <br />
          <br />

          निकाय द्वारा अपने नागरिकों को जन-स्वास्थ्य सेवाऐं जैसे- कचरा निस्तारण,
          सार्वजनिक व सामुदायिक शौचालय की व्यवस्था, मृत पशुओं का निस्तारण,
          संक्रामक रोगों से बचाव, जन्म-मृत्यु पंजीकरण आदि के साथ-साथ सड़क, नाली,
          नालियों जैसे सार्वजनिक निर्माण, पथ-प्रकाश व्यवस्था, जलापूर्ति, कर
          आरोपण व्यवस्था, सम्पत्ति नामान्तरण, भवन मानचित्र की स्वीकृति, अनापत्ति
          प्रमाण-पत्र व शहरी नियोजन हेतु आवश्यक कार्यों को सम्पादित किया जा रहा
          {/* The waste management application also allows Noorpur Nagar Palika
          authorities to efficiently monitor and manage waste collection in all
          29 wards. Through this system, they can track the performance of
          garbage collectors, allocate resources effectively,The application
          promotes transparency by enabling residents to provide feedback,
          ensuring their voices are heard. By integrating digital technology
          into waste management, Noorpur Nagar Palika hopes to make the city
          cleaner and greener. The app also supports sustainability efforts,
          encouraging residents to separate recyclable materials from
          non-recyclable waste, contributing to a more eco-friendly environment. */}
        </p>
        {/* <p>
          नगरपालिका परिषद नूरपुर जनपद-बिजनौर की एक महत्वपूर्ण शहरी निकाय है जो
          मुरादाबाद-बिजनौर रोड पर स्थित है। कस्बा नूरपुर से कई महत्वपूर्ण सड़क
          मार्ग गुजरते हैं जैसे — हरिद्वार-नूरपुर-अमरोहा,
          बिजनौर-नूरपुर-मुरादाबाद, नूरपुर-स्वाहारा-काशीपुर,
          नूरपुर-चांदपुर-गजरौला आदि, जिसके कारण से कस्बा सड़क मार्गों के बेहतर
          सम्पर्क से जुड़ा है। इसका क्षेत्रफल लगभग 1.55 वर्ग कि॰मी॰ है। वर्ष
          2011 की जनगणना के अनुसार कस्बे की कुल जनसंख्या — 38,801 है जिसमें
          20,120 पुरुष 18,190 महिलाएं व 01 अन्य सामिलित हैं। क्षेत्र की
          महत्वपूर्ण भौगोलिक स्थिति व बढ़ते हुए औद्योगिक केन्द्र को दृष्टिगत
          रखते हुए सरकार के द्वारा 29 सितम्बर 1977 को नगर पंचायत के रूप में
          मान्यता दी गई जिसे बाद में 01 अगस्त 1983 को नगरपालिका परिषद के रूप में
          उच्चीकृत किया गया। वर्तमान में निकाय तृतीय श्रेणी की नगरपालिका है
          जिसमें कुल 25 वार्ड हैं।
          <br />
          <br />
          कस्बे में अनब्लॉक जेकट निर्माण का कार्य बड़े पैमाने पर किया जाता है।
          कस्बे में स्थित शहीद स्मारक स्थल (मौ० शहीदनगर वार्ड सं०-21) भारत छोड़ो
          आन्दोलन से सम्बंधित एक प्रमुख ऐतिहासिक स्थल है जहां भारत छोड़ो आन्दोलन
          के दौरान थाना नूरपुर पर क्रांतिकारियों द्वारा ध्वजारोहण के दौरान पुलिस
          मुठभेड़ हुई जिसमें 02 क्रांतिकारी— शहीद परवीन सिंह व शहीद रिखी सिंह
          शहीद हो गये। क्रांतिकारियों की याद में यहां प्रतिवर्ष 16 अगस्त को
          उत्सव मनाया जाता है तथा इन क्रांतिकारी वीरों की शहादत को श्रद्धांजलि
          दी जाती है।
          <br />
          <br />
          कस्बा नूरपुर अपनी समृद्ध सांस्कृतिक विरासत व धार्मिक सद्भाव के रूप में
          जाना जाता है। यहां हिन्दू मुस्लिम, सिक्ख, ईसाई सभी सम्प्रदायों व
          धर्मों के लोग मिल-जुल कर सद्भावपूर्वक रहते हैं। मोहर्रम का जुलूस,
          रामडोल शौभायात्रा, नगर कीर्तन, श्री रामजी की बारात व श्री रविदास व डा०
          भीमराव अम्बेडकर जी की जयन्ती पर निकाली जाने वाली शौभा यात्राओं में इसे
          आसानी से देखा जा सकता है।
          <br />
          <br />
          निकाय द्वारा अपने नागरिकों को जन-स्वास्थ्य सेवाऐं जैसे- कचरा निस्तारण,
          सार्वजनिक व सामुदायिक शौचालय की व्यवस्था, मृत पशुओं का निस्तारण,
          संक्रामक रोगों से बचाव, जन्म-मृत्यु पंजीकरण आदि के साथ-साथ सड़क, नाली,
          नालियों जैसे सार्वजनिक निर्माण, पथ-प्रकाश व्यवस्था, जलापूर्ति, कर
          आरोपण व्यवस्था, सम्पत्ति नामान्तरण, भवन मानचित्र की स्वीकृति, अनापत्ति
          प्रमाण-पत्र व शहरी नियोजन हेतु आवश्यक कार्यों को सम्पादित किया जा रहा
          है। निकाय अपने नागरिकों को बेहतर सुविधा देने हेतु सदैव प्रतिबद्ध है।
        </p> */}
      </div>

      {/* Right Section - Image */}
      <div className="md:w-1/2 w-full relative h-auto md:h-auto flex justify-end">
        <Image
          src="/garbagecollecter.jpg" // Replace with your image path
          alt="Garbage Collection Truck"
          width={670}
          height={500}
          objectFit="cover"
          className="rounded-lg"
        />
      </div>
    </div>
  );
};

export default Aboutnagarpalika;
